docs/benchmark/results-wrk2-c1000/raw/nginx-R80000-r3.txt
Running 15s test @ http://127.0.0.1:8088/
  4 threads and 1000 connections
  Thread calibration: mean lat.: 2.571ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.586ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.552ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.473ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  711.18us  13.26ms   77.22%
    Req/Sec    21.05k     1.95k   32.40k    74.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.67ms
 90.000%    2.05ms
 99.000%    3.53ms
 99.900%    7.81ms
 99.990%   11.19ms
 99.999%   12.70ms
100.000%   13.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.059     0.000000            1         1.00
       0.555     0.100000        29998         1.11
       0.748     0.200000        60065         1.25
       0.914     0.300000        90073         1.43
       1.079     0.400000       120110         1.67
       1.235     0.500000       150103         2.00
       1.314     0.550000       165026         2.22
       1.398     0.600000       180034         2.50
       1.486     0.650000       195107         2.86
       1.575     0.700000       209991         3.33
       1.667     0.750000       225018         4.00
       1.717     0.775000       232496         4.44
       1.771     0.800000       240075         5.00
       1.828     0.825000       247584         5.71
       1.891     0.850000       255016         6.67
       1.965     0.875000       262500         8.00
       2.007     0.887500       266233         8.89
       2.053     0.900000       270078        10.00
       2.101     0.912500       273820        11.43
       2.157     0.925000       277548        13.33
       2.225     0.937500       281234        16.00
       2.267     0.943750       283087        17.78
       2.319     0.950000       285042        20.00
       2.379     0.956250       286887        22.86
       2.453     0.962500       288745        26.67
       2.565     0.968750       290591        32.00
       2.637     0.971875       291522        35.56
       2.725     0.975000       292470        40.00
       2.837     0.978125       293398        45.71
       2.983     0.981250       294335        53.33
       3.159     0.984375       295276        64.00
       3.249     0.985938       295741        71.11
       3.345     0.987500       296215        80.00
       3.453     0.989062       296685        91.43
       3.599     0.990625       297151       106.67
       3.785     0.992188       297614       128.00
       3.905     0.992969       297852       142.22
       4.025     0.993750       298087       160.00
       4.171     0.994531       298324       182.86
       4.359     0.995313       298554       213.33
       4.651     0.996094       298788       256.00
       4.823     0.996484       298903       284.44
       5.075     0.996875       299021       320.00
       5.427     0.997266       299137       365.71
       5.963     0.997656       299255       426.67
       6.603     0.998047       299374       512.00
       6.843     0.998242       299430       568.89
       7.139     0.998437       299490       640.00
       7.359     0.998633       299547       731.43
       7.599     0.998828       299607       853.33
       7.851     0.999023       299665      1024.00
       7.987     0.999121       299694      1137.78
       8.143     0.999219       299724      1280.00
       8.359     0.999316       299753      1462.86
       8.519     0.999414       299783      1706.67
       8.735     0.999512       299812      2048.00
       8.911     0.999561       299826      2275.56
       9.063     0.999609       299841      2560.00
       9.391     0.999658       299855      2925.71
       9.743     0.999707       299870      3413.33
      10.047     0.999756       299884      4096.00
      10.247     0.999780       299892      4551.11
      10.351     0.999805       299899      5120.00
      10.487     0.999829       299906      5851.43
      10.639     0.999854       299914      6826.67
      10.927     0.999878       299921      8192.00
      11.143     0.999890       299925      9102.22
      11.199     0.999902       299928     10240.00
      11.311     0.999915       299932     11702.86
      11.391     0.999927       299937     13653.33
      11.415     0.999939       299939     16384.00
      11.447     0.999945       299943     18204.44
      11.447     0.999951       299943     20480.00
      11.471     0.999957       299946     23405.71
      11.791     0.999963       299947     27306.67
      12.063     0.999969       299948     32768.00
      12.119     0.999973       299949     36408.89
      12.263     0.999976       299950     40960.00
      12.399     0.999979       299951     46811.43
      12.511     0.999982       299952     54613.33
      12.535     0.999985       299953     65536.00
      12.535     0.999986       299953     72817.78
      12.703     0.999988       299954     81920.00
      12.703     0.999989       299954     93622.86
      13.159     0.999991       299956    109226.67
      13.159     0.999992       299956    131072.00
      13.159     0.999993       299956    145635.56
      13.159     0.999994       299956    163840.00
      13.159     0.999995       299956    187245.71
      13.159     0.999995       299956    218453.33
      13.159     0.999996       299956    262144.00
      13.159     0.999997       299956    291271.11
      13.263     0.999997       299957    327680.00
      13.263     1.000000       299957          inf
#[Mean    =        1.308, StdDeviation   =        0.711]
#[Max     =       13.256, Total count    =       299957]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1150612 requests in 15.00s, 731.91MB read
Requests/sec:  76703.23
Transfer/sec:     48.79MB